Revit 2027 API
CreateRelatedFileProgressChangedEventArgs.CreatingCloudSharedLocal Property
 Indicates if it is creating cloud shared local model.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CreatingCloudSharedLocal { get; }
Public ReadOnly Property CreatingCloudSharedLocal As Boolean
	Get
public:
property bool CreatingCloudSharedLocal {
	bool get ();
}
member CreatingCloudSharedLocal : bool with get
Property Value
Boolean
See Also
Reference
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace